pkg/openfoam/coupling/terminalVelocity/constant/transportProperties

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



continuousPhaseName oil;


rho.oil         1000;
partDensity       1500;


phases (oil water);

oil
{
    transportModel  Newtonian;
    nu              1e-05;
    rho             1800.00;
}

water
{
    transportModel  Newtonian;
    nu              1.e-04;
    rho             1000;
}

sigma               0.072;


// ************************************************************************* //
