pkg/openfoam/coupling/terminalVelocity/0_org/p_rgh

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            fixedValue;
        value           uniform 0;
    }


    bottom
    {
    type            fixedFluxPressure;
    value           uniform 0;    }

    back
    {
    type            fixedFluxPressure;
    value           uniform 0;    }
    front
    {
    type            fixedFluxPressure;
    value           uniform 0;    }
    inlet
    {
    type            fixedFluxPressure;
    value           uniform 0;    }
    outlet
    {
    type            fixedFluxPressure;
    value           uniform 0;    }

}

// ************************************************************************* //
