pkg/openfoam/coupling/terminalVelocity/0_org/alpha.oil
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
top
{
    type            fixedValue;
    value           uniform 0;
}


bottom
{
    type            zeroGradient;
}

back
{
  type           constantAlphaContactAngle;
  theta0         45;
  limit          gradient;
  value          uniform 0;

    // type            zeroGradient;
}
front
{
  type           constantAlphaContactAngle;
  theta0         45;
  limit          gradient;
  value          uniform 0;

    // type            zeroGradient;
}
inlet
{
  type           constantAlphaContactAngle;
  theta0         45;
  limit          gradient;
  value          uniform 0;

    // type            zeroGradient;
}
outlet
{
  type           constantAlphaContactAngle;
theta0         45;
limit          gradient;
value          uniform 0;

    // type            zeroGradient;
}
}



// ************************************************************************* //
