pkg/openfoam/coupling/terminalVelocity/system/fvSolution

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    "alpha.oil.*"
          {
          nAlphaCorr      1;
          nAlphaSubCycles 3;
          cAlpha          1;

          MULESCorr       yes;
          nLimiterIter    5;

          solver          smoothSolver;
          smoother        symGaussSeidel;
          tolerance       1e-8;
          relTol          0;

      }

    "(p_rgh)"
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.01;
        smoother        GaussSeidel;
    }

    "(p_rgh)Final"
    {
        solver          GAMG;
        tolerance       1e-09;
        relTol          0;
        smoother        GaussSeidel;
    }

        "pcorr.*"
        {
            solver          PCG;
            preconditioner
            {
                preconditioner  GAMG;
                tolerance       1e-05;
                relTol          0;
                smoother        DICGaussSeidel;
                cacheAgglomeration no;
            }

            tolerance       1e-05;
            relTol          0;
            maxIter         100;
        }
    "(U.oil|k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.01;
    }

    "(U.oil|k|omega)Final"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-09;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors 2;
    nCorrectors     3;
    momentumPredictor no;
    nNonOrthogonalCorrectors 0;
  //  pRefCell        0;
  //  pRefValue       0;
}

relaxationFactors
{
}


// ************************************************************************* //
