pkg/openfoam/coupling/terminalVelocity/system/decomposeParDict

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 2;

//method          scotch;
method          hierarchical;

strategies
{
  
  optional;

}


//simpleCoeffs
//{
//    n               ( 1);
//    delta           0.001;
//}
//
hierarchicalCoeffs
{
    n               (1 2 1);
    delta           0.001;
    order           yxz;
}
//
//manualCoeffs
//{
//    dataFile        "";
//}

distributed     no;

roots           ( );


// ************************************************************************* //
